/*	EQEMu: Everquest Server Emulator
	Copyright (C) 2001-2005 EQEMu Development Team (http://eqemulator.net)

	This program is free software; you can redistribute it and/or modify
	it under the terms of the GNU General Public License as published by
	the Free Software Foundation; version 2 of the License.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY except by those people which sell it, which
	are required to give you total support for your newly bought product;
	without even the implied warranty of MERCHANTABILITY or FITNESS FOR
	A PARTICULAR PURPOSE. See the GNU General Public License for more details.

	You should have received a copy of the GNU General Public License
	along with this program; if not, write to the Free Software
	Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA
*/
#ifndef SPDAT_H
#define SPDAT_H

#include "classes.h"
#include "skills.h"

#define SPELL_UNKNOWN 0xFFFF
#define SPELLBOOK_UNKNOWN 0xFFFFFFFF		//player profile spells are 32 bit

//some spell IDs which will prolly change, but are needed
#define SPELL_LEECH_TOUCH 2766
#define SPELL_LAY_ON_HANDS 87
#define SPELL_HARM_TOUCH 88
#define SPELL_HARM_TOUCH2 2821
#define SPELL_IMP_HARM_TOUCH 2774
#define SPELL_NPC_HARM_TOUCH 929


#define EFFECT_COUNT 12
#define MAX_SPELL_TRIGGER 12	// One for each slot(only 6 for AA since AA use 2)
#define MAX_RESISTABLE_EFFECTS 12	// Number of effects that are typcially checked agianst resists.


//#define SE_Unknown415					415 // not used
#define SE_ACv2							416 // implemented - New AC spell effect
#define SE_ManaRegen_v2					417 // implemented - New mana regen effect
#define SE_SkillDamageAmount2			418 // implemented - adds skill damage directly to certain attacks
#define SE_AddMeleeProc					419 // implemented - Adds a proc
//#define SE_Unknown420					420 // *not used
#define SE_IncreaseNumHits				421 // implemented[AA] - increases number of hits a buff has till fade. (focus)
//#define SE_Unknown422					422 // not used - Seen in Lasting Bravery likely a focus limit
//#define SE_Unknown423					423 // not used	- Seen in Lasting Bravery likely a focus limit
#define SE_GravityEffect				424 // implemented - Pulls/pushes you toward/away the mob at a set pace
#define SE_Display						425 // *not implemented - Illusion: Flying Dragon(21626)
#define SE_IncreaseExtTargetWindow		426 // *not implmented[AA] - increases the capacity of your extended target window
#define SE_SkillProc					427 // implemented - chance to proc when using a skill(ie taunt)
#define SE_LimitToSkill					428 // implemented - limits what skills will effect a skill proc
#define SE_SkillProc2					429 // implemented - chance to proc when using a skill (most have hit limits)
//#define SE_Unknown430					430 // *not implemented - Fear of the Dark(27641)
//#define SE_Unknown431					431 // *not implemented - Fear of the Dark(27641)
//#define SE_Unknown432					432 // not used
//#define SE_Uknonwn433					433 // not used
#define SE_CriticalHealChance2			434 // implemented - increase critical heal chance
#define SE_CriticalHealOverTime2		435 // implemented - increase critical heal over time chance
//#define SE_Unknown432					436 // not used
#define SE_Anchor						437 // *not implemented - Teleport Guild Hall Anchor(33099)
//#define SE_Unknown438					438 // not used
#define SE_IncreaseAssassinationLvl		439 // *not implemented[AA] - increases the maximum level of humanoid that can be affected by assassination
#define SE_FinishingBlowLvl				440 // implemented[AA] - Sets the level Finishing blow can be triggered on an NPC
#define SE_MovementSpeed2				441 // *not implemented - new snare effect
#define SE_TriggerOnHPAmount			442 // *not implemented - triggers a spell which a certain hp level is reached
//#define SE_Unknown443					443 // *not implemented - related to Finishing Blow AA
#define SE_AggroLock					444 // *not implemented - target will ignore all but caster for duration
#define SE_AdditionalMercenary			445 // *not implemented[AA] - [Hero's Barracks] Allows you to conscript additional mercs.
// LAST


#define DF_Permanent			50

// solar: note this struct is historical, we don't actually need it to be
// aligned to anything, but for maintaining it it is kept in the order that
// the fields in the text file are. the numbering is not offset, but field
// number. note that the id field is counted as 0, this way the numbers
// here match the numbers given to sep in the loading function net.cpp
//
struct SPDat_Spell_Struct
{
/* 000 */	//int id;	// not used
/* 001 */	char		name[64]; // Name of the spell
/* 002 */	char		player_1[32]; // "PLAYER_1"
/* 003 */	char		teleport_zone[64];	// Teleport zone, pet name summoned, or item summoned
/* 004 */	char		you_cast[64]; // Message when you cast
/* 005 */	char		other_casts[64]; // Message when other casts
/* 006 */	char		cast_on_you[64]; // Message when spell is cast on you
/* 007 */	char		cast_on_other[64]; // Message when spell is cast on someone else
/* 008 */	char		spell_fades[64]; // Spell fades
/* 009 */	float		range;
/* 010 */	float		aoerange;
/* 011 */	float		pushback;
/* 012 */	float		pushup;
/* 013 */	uint32		cast_time; // Cast time
/* 014 */	uint32		recovery_time; // Recovery time
/* 015 */	uint32		recast_time; // Recast same spell time
/* 016 */	uint32		buffdurationformula;
/* 017 */	uint32		buffduration;
/* 018 */	uint32		AEDuration;	// sentinel, rain of something
/* 019 */	uint16		mana; // Mana Used
/* 020 */	int			base[EFFECT_COUNT];	//various purposes
/* 032 */	int			base2[EFFECT_COUNT]; //various purposes
/* 044 */	int32		max[EFFECT_COUNT];
/* 056 */	//uint16 icon; // Spell icon
/* 057 */	//uint16 memicon; // Icon on membarthing
/* 058 */	int32		components[4]; // reagents
/* 062 */	int			component_counts[4]; // amount of regents used
/* 066 */	int			NoexpendReagent[4];	// focus items (Need but not used; Flame Lick has a Fire Beetle Eye focus.)
											// If it is a number between 1-4 it means components[number] is a focus and not to expend it
											// If it is a valid itemid it means this item is a focus as well
/* 070 */	uint16		formula[EFFECT_COUNT]; // Spell's value formula
/* 082 */	//int LightType; // probaly another effecttype flag
/* 083 */	int8 goodEffect; //0=detrimental, 1=Beneficial, 2=Beneficial, Group Only
/* 084 */	int			Activated; // probaly another effecttype flag
/* 085 */	int			resisttype;
/* 086 */	int			effectid[EFFECT_COUNT];	// Spell's effects
/* 098 */	SpellTargetType	targettype;	// Spell's Target
/* 099 */	int			basediff; // base difficulty fizzle adjustment
/* 100 */	SkillType	skill;
/* 101 */	int8 zonetype; // 01=Outdoors, 02=dungeons, ff=Any
/* 102 */	int8 EnvironmentType;
/* 103 */	int8 TimeOfDay;
/* 104 */	uint8		classes[PLAYER_CLASS_COUNT]; // Classes, and their min levels
/* 120 */	uint8		CastingAnim;
/* 121 */	//uint8 TargetAnim;
/* 122 */	//uint32 TravelType;
/* 123 */	uint16		SpellAffectIndex;
/* 124 */	int8 disallow_sit; // 124: high-end Yaulp spells (V, VI, VII, VIII [Rk 1, 2, & 3], & Gallenite's Bark of Fury
/* 125 */								// 125: Words of the Skeptic
/* 126 */	int8		deities[16];	// Deity check. 201 - 216 per http://www.eqemulator.net/wiki/wikka.php?wakka=DeityList
										// -1: Restrict to Deity; 1: Restrict to Deity, but only used on non-Live (Test Server "Blessing of ...") spells; 0: Don't restrict
/* 142 */						// 142: between 0 & 100
								// 143: always set to 0
/* 144 */	//int16 new_icon	// Spell icon used by the client in uifiles/default/spells??.tga, both for spell gems & buff window. Looks to depreciate icon & memicon
/* 145 */	//int16 spellanim; // Doesn't look like it's the same as #doanim, so not sure what this is
/* 146 */	int8		uninterruptable;	// Looks like anything != 0 is uninterruptable. Values are mostly -1, 0, & 1 (Fetid Breath = 90?)
/* 147 */	int16		ResistDiff;
/* 148 */	//int dot_stacking_exempt;
/* 149 */	//int deletable;
/* 150 */	uint16 RecourseLink;
/* 151 */						// 151: -1, 0, or 1
								// 152 & 153: all set to 0
/* 154 */	int8		short_buff_box;	// != 0, goes to short buff box.
/* 155 */	int			descnum; // eqstr of description of spell
/* 156 */	//int typedescnum; // eqstr of type description
/* 157 */	int			effectdescnum; // eqstr of effect description
/* 158 */
/* 162 */	int			bonushate;
/* 163 */
/* 166 */	int			EndurCost;
/* 167 */	int8 EndurTimerIndex;
/* 168 */	//int IsDisciplineBuff; //Will goto the combat window when cast
/* 169 */
/* 173 */	int			HateAdded;
/* 174 */	int			EndurUpkeep;
/* 175 */
/* 176 */	int			numhits;
/* 177 */	int			pvpresistbase;
/* 178 */	int			pvpresistcalc;
/* 179 */	int			pvpresistcap;
/* 180 */	int			spell_category;
/* 181 */
/* 185 */	int8 can_mgb; // 0=no, -1 or 1 = yes
/* 186 */	int			dispel_flag;
/* 189 */	int			MinResist;
/* 190 */	int			MaxResist;
/* 191 */	uint8 viral_targets;
/* 192 */	uint8 viral_timer;
/* 193 */	int			NimbusEffect;
/* 194 */	float		directional_start;
/* 195 */	float		directional_end;
/* 207 */	int			spellgroup;
/* 209 */	int			powerful_flag; // Need more investigation to figure out what to call this, for now we know -1 makes charm spells not break before their duration is complete, it does alot more though
/* 211 */	int			CastRestriction; //Various restriction categories for spells most seem targetable race related but have also seen others for instance only castable if target hp 20% or lower or only if target out of combat
/* 212 */	bool		AllowRest;
/* 219 */	//int maxtargets; // not in DB yet, is used for beam and ring spells for target # limits
			uint8		DamageShieldType; // This field does not exist in spells_us.txt
};

extern const SPDat_Spell_Struct* spells;
extern int32 SPDAT_RECORDS;

bool IsTargetableAESpell(uint16 spell_id);
bool IsSacrificeSpell(uint16 spell_id);
bool IsLifetapSpell(uint16 spell_id);
bool IsMezSpell(uint16 spell_id);
bool IsStunSpell(uint16 spell_id);
bool IsSlowSpell(uint16 spell_id);
bool IsHasteSpell(uint16 spell_id);
bool IsHarmonySpell(uint16 spell_id);
bool IsPercentalHealSpell(uint16 spell_id);
bool IsGroupOnlySpell(uint16 spell_id);
bool IsBeneficialSpell(uint16 spell_id);
bool IsDetrimentalSpell(uint16 spell_id);
bool IsInvulnerabilitySpell(uint16 spell_id);
bool IsCHDurationSpell(uint16 spell_id);
bool IsPoisonCounterSpell(uint16 spell_id);
bool IsDiseaseCounterSpell(uint16 spell_id);
bool IsSummonItemSpell(uint16 spell_id);
